[
  {
    "id": "9084986f-456c-449b-ae6e-59ef1f26b129",
    "title": "CSS em Profundidade",
    "author": "Keith J. Grant",
    "genre": "Desenvolvimento Web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_zIgYlIxcY.png",
    "coverColor": "#1e2a4b",
    "description": "CSS em Profundidade de Keith J. Grant é um guia abrangente para desenvolvedores web que desejam ir além do básico de CSS e dominar as complexidades da estilização de páginas web. O livro é projetado para desenvolvedores intermediários a avançados que já estão familiarizados com CSS, mas desejam aprofundar seu entendimento e aproveitar todo o seu potencial.",
    "totalCopies": 18,
    "availableCopies": 16,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_O-O0Z_Vz5.png",
    "summary": "CSS em Profundidade começa revisando os princípios básicos do CSS, depois avança rapidamente para conceitos mais avançados. Grant enfatiza a importância de entender a mecânica subjacente de propriedades do CSS como layout, modelo de caixa e posicionamento. Os leitores aprendem como usar essas ferramentas de forma mais eficaz, tornando seu código mais previsível e fácil de depurar.\n\nO livro dedica um tempo significativo para discutir sistemas de layout modernos, especialmente Flexbox e CSS Grid. Essas ferramentas poderosas permitem que os desenvolvedores criem designs complexos e responsivos com código mínimo. Grant explica como usá-las em diferentes contextos, fornecendo exemplos práticos de quando e por que elas são úteis.\n\nUm dos destaques do livro é sua cobertura detalhada de animações e transições. Os leitores aprendem como adicionar efeitos dinâmicos às suas páginas web sem depender de JavaScript. Isso é especialmente útil para criar designs suaves e interativos que melhoram a experiência do usuário.\n\nO livro também discute pré-processadores CSS e metodologias como BEM (Block Element Modifier), ensinando os desenvolvedores a estruturar suas folhas de estilo para projetos maiores. Grant incentiva práticas recomendadas, como manter o CSS DRY (Don’t Repeat Yourself) e modularizar o código.\n\nAo final do livro, os leitores terão o conhecimento e a confiança para enfrentar desafios complexos de CSS e criar interfaces web impressionantes com eficiência e elegância."
  },
  {
    "id": "350c3bc8-a5cc-45a3-ba16-97b93ed056b0",
    "title": "HTML e CSS: Projete e Construa Websites",
    "author": "Jon Duckett",
    "genre": "Desenvolvimento Web",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_1pCoBDI11.png",
    "coverColor": "#3a2931",
    "description": "Se você é um iniciante completo ou alguém que deseja revisar HTML e CSS, este livro fornece uma base sólida e habilidades práticas que podem ser aplicadas imediatamente em projetos do mundo real.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_MONyhmpr4V.png",
    "summary": "HTML e CSS: Projete e Construa Websites começa com uma introdução ao HTML, cobrindo os blocos básicos de construção de uma página web, incluindo elementos como títulos, parágrafos, links e imagens. Duckett explica cuidadosamente a estrutura e a sintaxe do HTML, ensinando os leitores a escrever e organizar seu código.\n\nO livro então passa para o CSS, mostrando aos leitores como aplicar estilos aos seus elementos HTML. Tópicos como fontes, cores, bordas, padding e margens são introduzidos de forma clara e fácil de entender. Duckett usa muitos exemplos visuais para ajudar os leitores a ver o impacto imediato dos estilos que aplicam.\n\nÀ medida que o livro avança, os leitores mergulham em técnicas de layout, aprendendo sobre o modelo de caixa, posicionamento, floats e layouts flexíveis com CSS Flexbox. O conceito de design responsivo também é abordado, ensinando os leitores a fazer seus sites se adaptarem a diferentes tamanhos de tela e dispositivos.\n\nPor toda parte, o livro está repleto de dicas e técnicas práticas para criar sites bonitos e funcionais. As explicações claras e o layout colorido de Duckett tornam tópicos complexos mais fáceis de entender, tornando este livro um guia perfeito para qualquer pessoa que esteja começando sua jornada no desenvolvimento web."
  },
  {
    "id": "b514f922-a715-45ec-846e-e51d40e15aa2",
    "title": "Entrevista de Design de Sistemas",
    "author": "Alex Xu",
    "genre": "Design de Sistemas",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_CmVaNeXrQ.png",
    "coverColor": "#363b63",
    "description": "Entrevista de Design de Sistemas: Um Guia de um Insider de Alex Xu é uma leitura obrigatória para engenheiros de software e profissionais que estão se preparando para entrevistas de design de sistemas. O livro fornece uma visão detalhada dos princípios e técnicas necessários para se destacar em entrevistas de design de sistemas, que muitas vezes são uma parte fundamental do processo de contratação em grandes empresas de tecnologia.",
    "totalCopies": 10,
    "availableCopies": 10,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_x_vGP6M7Y.png",
    "summary": "Entrevista de Design de Sistemas: Um Guia de um Insider começa introduzindo os conceitos-chave de design de sistemas, enfatizando a importância de entender requisitos, escalabilidade e confiabilidade. Xu explica como abordar um problema aberto, dividindo-o em componentes menores e gerenciáveis, garantindo uma resposta estruturada.\n\nO livro cobre tópicos essenciais, como design de banco de dados, caching, balanceamento de carga e filas de mensagens, explicando sua relevância na construção de sistemas escaláveis e tolerantes a falhas. Xu também explora as complexidades de projetar sistemas de alta disponibilidade, explicando conceitos como replicação, particionamento e sharding.\n\nOs leitores são guiados por vários problemas de design de sistemas do mundo real, desde o design de um serviço de encurtamento de URL até a construção de um sistema de recomendação. Cada exemplo fornece uma análise detalhada das compensações envolvidas, oferecendo insights valiosos sobre como otimizar sistemas para desempenho, custo e manutenibilidade.\n\nXu também enfatiza a importância da comunicação durante as entrevistas de design de sistemas, ensinando os leitores a apresentar suas soluções de forma clara e justificar suas decisões. Com problemas práticos e dicas sobre como lidar com perguntas difíceis, o livro é um recurso essencial para qualquer pessoa que deseja se destacar em uma entrevista de design de sistemas."
  },
  {
    "id": "b4ed06bf-02b2-42c4-8886-b3847af02cca",
    "title": "Ciência da Computação Destilada",
    "author": "Wladston Ferreira Filho",
    "genre": "Ciência da Computação",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_ZRyGl0A75A.png",
    "coverColor": "#73d173",
    "description": "Ciência da Computação Destilada de Wladston Ferreira Filho é uma introdução concisa e acessível aos conceitos fundamentais da ciência da computação. Projetado para iniciantes e para aqueles que desejam fortalecer suas habilidades de resolução de problemas, o livro divide tópicos complexos em partes digeríveis e fáceis de entender.",
    "totalCopies": 89,
    "availableCopies": 87,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_W6XGeHaEO.png",
    "summary": "Ciência da Computação Destilada começa explicando a arte da resolução de problemas na computação, enfatizando a importância de dividir problemas em partes gerenciáveis. Ele introduz conceitos computacionais-chave, como abstração, algoritmos e análise de complexidade, fornecendo uma base sólida para enfrentar qualquer desafio de programação.\n\nO livro explora estruturas de dados, incluindo arrays, listas encadeadas, pilhas, filas e árvores, com explicações claras e recursos visuais para tornar esses conceitos abstratos tangíveis. Os leitores aprendem como selecionar a estrutura de dados certa para diferentes cenários, aumentando a eficiência de suas soluções.\n\nO raciocínio lógico e o design de algoritmos são temas centrais. O autor mergulha em ordenação, busca e recursão, apresentando esses tópicos de forma acessível. Ele também destaca a importância das compensações no design de algoritmos, como complexidade de tempo versus espaço.\n\nCapítulos posteriores se concentram em técnicas práticas de resolução de problemas, incentivando os leitores a abordar desafios de forma criativa, mantendo a eficiência computacional. O livro inclui exercícios para reforçar o aprendizado, tornando-o altamente interativo.\n\nNo final, os leitores obtêm uma compreensão sólida dos fundamentos da ciência da computação, permitindo que escrevam programas melhores e pensem como solucionadores de problemas. Seu formato conciso garante clareza e retenção sem sobrecarregar o leitor."
  },
  {
    "id": "dc73abc1-8699-4e0a-91b0-a67e80292b9c",
    "title": "A Arte da Linguagem Assembly",
    "author": "Randall Hyde",
    "genre": "Programação",
    "rating": 3,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_lZrAopUNM.png",
    "coverColor": "#fff9bf",
    "description": "A Arte da Linguagem Assembly de Randall Hyde é uma introdução abrangente e envolvente à programação em linguagem assembly. Conhecido por sua clareza e profundidade, o livro fornece aos leitores uma base sólida em conceitos de programação de baixo nível, essenciais para entender como os computadores operam em seu núcleo.",
    "totalCopies": 78,
    "availableCopies": 78,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_VGtFawJik.png",
    "summary": "A Arte da Linguagem Assembly introduz os leitores aos fundamentos da programação em assembly, começando com uma visão geral da arquitetura de computadores. Ele explica como as CPUs processam instruções e gerenciam dados, fornecendo o contexto necessário para apreciar o poder da linguagem assembly.\n\nO livro então passa para a programação prática, começando com a representação de dados e o gerenciamento de memória. Os leitores aprendem como inteiros, números de ponto flutuante e outros tipos de dados são armazenados e manipulados no nível binário. Hyde usa o HLA como uma ponte, tornando os conceitos de linguagem assembly mais fáceis de entender, mantendo o foco nos princípios subjacentes.\n\nEstruturas de controle, incluindo loops, condicionais e funções, são explicadas em detalhes. Hyde mostra como esses elementos funcionam em assembly, oferecendo uma compreensão mais profunda de como as linguagens de alto nível se traduzem em código de máquina.\n\nTópicos avançados incluem técnicas de otimização, interações com hardware e programação em nível de sistema. O livro explora como o assembly pode ser usado para ajustar o desempenho de aplicações críticas e interagir diretamente com componentes de hardware.\n\nPor toda parte, a ênfase está na clareza e na aplicação prática. O livro inclui inúmeros exercícios, exemplos do mundo real e explicações detalhadas, tornando-o um recurso valioso para qualquer pessoa que deseja dominar a linguagem assembly ou obter insights mais profundos sobre as operações dos computadores."
  },
  {
    "id": "17a58b62-0258-45a5-8b8b-9a21a6d6630c",
    "title": "Software Realmente Bom",
    "author": "Marco Faella",
    "genre": "Programação",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_YiFXdp5P_T.png",
    "coverColor": "#061e20",
    "description": "Este livro é perfeito para desenvolvedores que desejam elevar suas habilidades de codificação além da funcionalidade, tornando seu trabalho robusto e profissional. Escrito em um estilo acessível, Software Realmente Bom faz a ponte entre princípios teóricos e aplicação prática.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_LhwRi_a9cJ.png",
    "summary": "Software Realmente Bom começa explorando os princípios fundamentais do desenvolvimento de software, enfatizando a importância da correção—o software deve funcionar conforme o esperado em todas as condições especificadas. Faella usa exemplos claros para mostrar como identificar e corrigir erros que podem comprometer a correção do código.\n\nO livro avança para a legibilidade, destacando como um código limpo e bem documentado melhora a colaboração e reduz os custos de manutenção. Os desenvolvedores aprendem técnicas para refatorar o código para melhorar a legibilidade sem comprometer a funcionalidade.\n\nDesempenho e escalabilidade são abordados com dicas práticas sobre como otimizar o código para lidar com cargas de trabalho crescentes e se adaptar ao crescimento. Faella explica como usar ferramentas de profiling, otimizar algoritmos e fazer compensações para aumentar a eficiência.\n\nA segurança é outro foco importante, com o livro cobrindo técnicas para proteger o software contra vulnerabilidades e possíveis ataques. A manutenção encerra a discussão, ensinando os desenvolvedores a escrever código modular e testável que se adapta a mudanças futuras.\n\nPor toda parte, Software Realmente Bom equilibra teoria com exemplos práticos, incentivando os desenvolvedores a aplicar as melhores práticas em seus projetos. Com sua ênfase no profissionalismo e no pensamento de longo prazo, o livro capacita os leitores a criar software que não apenas funciona, mas prospera."
  },
  {
    "id": "91445e57-01a8-4e1e-bb18-cf04b3a0b7d1",
    "title": "Fundamentos de Sistemas de Banco de Dados",
    "author": "Ramez Elmasri e Shamkant B. Navathe",
    "genre": "Ciência da Computação",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_9-sl0Jo8y.png",
    "coverColor": "#ffffff",
    "description": "Fundamentos de Sistemas de Banco de Dados de Ramez Elmasri e Shamkant B. Navathe é um livro-texto abrangente que serve como uma pedra angular para entender sistemas de banco de dados e suas aplicações. Este livro é amplamente utilizado na academia e na indústria para ensinar e aprender conceitos fundamentais e avançados de banco de dados.",
    "totalCopies": 145,
    "availableCopies": 145,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_UZULgWXVA.png",
    "summary": "Fundamentos de Sistemas de Banco de Dados começa introduzindo os conceitos fundamentais de sistemas de banco de dados, incluindo seu propósito, arquitetura e papel na computação moderna. Ele explica técnicas-chave de modelagem de dados, como o modelo Entidade-Relacionamento (ER), que é usado para projetar e visualizar esquemas de banco de dados.\n\nO livro explora minuciosamente a teoria de banco de dados relacional, incluindo álgebra relacional e SQL, equipando os leitores com as ferramentas para consultar e manipular dados com eficiência. Ele mergulha nos princípios de design de banco de dados, focando na normalização para eliminar redundância e manter a integridade dos dados.\n\nTópicos avançados incluem processamento de transações, onde os leitores aprendem sobre controle de concorrência e mecanismos de recuperação para garantir operações de banco de dados confiáveis e consistentes. O livro também cobre bancos de dados distribuídos e tecnologias emergentes como NoSQL e sistemas de big data, fornecendo insights sobre como lidar com conjuntos de dados massivos e arquiteturas escaláveis.\n\nAlém disso, os autores abordam segurança de banco de dados, indexação e otimização de desempenho, oferecendo uma visão holística do gerenciamento de banco de dados. Cada capítulo é complementado com exercícios, estudos de caso e exemplos do mundo real, tornando os conceitos práticos e acionáveis.\n\nNo geral, o livro fornece uma base sólida em sistemas de banco de dados, capacitando os leitores a projetar, implementar e gerenciar bancos de dados de forma eficaz em diversos ambientes."
  },
  {
    "id": "c3f2ff59-a3c2-47d2-a793-93457a9dccf7",
    "title": "Conceitos de Sistemas Operacionais",
    "author": "Abraham Silberschatz, Peter B. Galvin e Greg Gagne",
    "genre": "Ciência da Computação",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_W6Bz0KiBC.png",
    "coverColor": "#0e0e10",
    "description": "Conceitos de Sistemas Operacionais, frequentemente referido como o \"Livro dos Dinossauros\", é um guia definitivo para entender o funcionamento interno dos sistemas operacionais. Escrito por Abraham Silberschatz, Peter B. Galvin e Greg Gagne, este livro é um recurso essencial para estudantes, educadores e profissionais na área de ciência da computação.",
    "totalCopies": 97,
    "availableCopies": 97,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_rkMFYr5J0.png",
    "summary": "Conceitos de Sistemas Operacionais fornece uma exploração detalhada dos sistemas operacionais, começando com uma introdução ao seu papel fundamental na computação. Ele descreve como os sistemas operacionais gerenciam recursos de hardware, como CPU, memória e armazenamento, para garantir operação eficiente e confiável.\n\nO livro mergulha em tópicos críticos, como gerenciamento de processos e threads, ilustrando como multitarefa e concorrência são alcançadas. Ele explica algoritmos de escalonamento, técnicas de sincronização e métodos para lidar com deadlocks, fornecendo uma compreensão abrangente do controle de processos.\n\nO gerenciamento de memória é outro foco, com discussões detalhadas sobre paginação, segmentação e memória virtual. O livro explica como esses mecanismos otimizam a alocação de recursos enquanto garantem a estabilidade do sistema. Da mesma forma, os autores mergulham em sistemas de arquivos e estruturas de armazenamento, ilustrando como os dados são armazenados, recuperados e gerenciados.\n\nTópicos avançados incluem segurança, proteção e sistemas distribuídos. Os leitores aprendem sobre autenticação, controle de acesso e métodos para proteger sistemas operacionais contra possíveis ameaças. O livro também introduz desenvolvimentos modernos, como virtualização e computação em nuvem, tornando-o relevante no cenário tecnológico atual.\n\nCom um equilíbrio entre teoria e aplicação prática, Conceitos de Sistemas Operacionais capacita os leitores com o conhecimento necessário para projetar, analisar e otimizar sistemas operacionais de forma eficaz."
  },
  {
    "id": "fe03e013-53b8-4574-9ca8-caec69a9b16c",
    "title": "Algoritmos",
    "author": "Robert Sedgewick e Kevin Wayne",
    "genre": "Ciência da Computação",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_dr-f_LPwA.png",
    "coverColor": "#bf1e2e",
    "description": "Algoritmos de Robert Sedgewick e Kevin Wayne é um guia abrangente e autoritário para entender algoritmos e seu papel na computação moderna. Amplamente considerado um texto fundamental em ciência da computação, o livro cobre uma vasta gama de algoritmos, desde ordenação e busca até processamento de grafos e manipulação de strings.",
    "totalCopies": 321,
    "availableCopies": 318,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KSZGUHg5R.png",
    "summary": "Algoritmos é uma exploração minuciosa dos princípios algorítmicos e suas aplicações. Ele começa com o básico, introduzindo algoritmos elementares como ordenação e busca. Esses tópicos fundamentais são abordados em profundidade, explicando sua importância no manuseio eficiente e eficaz de dados.\n\nO livro então avança para tópicos mais complexos, como algoritmos de grafos e processamento de strings. O processamento de grafos, por exemplo, é explicado com casos de uso práticos, como conectividade de rede, caminhos mais curtos e árvores geradoras. Da mesma forma, algoritmos de strings abordam desafios em correspondência de padrões e análise de texto, oferecendo insights sobre sua relevância em campos como bioinformática e motores de busca.\n\nPor toda parte, os autores enfatizam o design e a análise de algoritmos. Eles focam em eficiência e escalabilidade, equipando os leitores com as ferramentas para avaliar o desempenho e escolher algoritmos apropriados para tarefas específicas.\n\nA implementação prática é um foco importante, com os autores fornecendo exemplos de código e exercícios que reforçam o aprendizado. O livro equilibra teoria e prática, garantindo que os leitores adquiram tanto conhecimento conceitual quanto habilidades práticas para resolver problemas do mundo real de forma eficaz."
  },
  {
    "id": "585df184-991b-4edf-9902-f8531c3a81d9",
    "title": "The Clean Coder",
    "author": "Robert C. Martin",
    "genre": "Software",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_EE5klEyX0.png",
    "coverColor": "#060709",
    "description": "The Clean Coder by Robert C. Martin is an essential guide for software developers who aspire to reach the highest standards of professionalism. Written by one of the most respected figures in the software engineering community, this book transcends technical skills, focusing on the mindset, ethics, and practices that define a professional programmer.",
    "totalCopies": 35,
    "availableCopies": 35,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_50K9AmWND.png",
    "summary": "The Clean Coder delves into the principles and practices of professional software development. The book begins by defining what it means to be a professional programmer, emphasizing the importance of taking responsibility for your work and acting with integrity. Martin highlights how professionalism goes beyond technical ability and requires a commitment to quality, discipline, and effective communication.\n\nA key focus of the book is mastering essential soft skills, such as time management and the art of saying “no.” Martin provides practical guidance for handling unrealistic expectations, prioritizing tasks, and maintaining a healthy work-life balance. Through engaging anecdotes, he explains how developers can balance their personal and professional lives while delivering consistent value to clients and stakeholders.\n\nThe book also underscores the significance of rigorous testing, clean coding practices, and continuous learning. Martin shares tips on writing better tests, debugging code efficiently, and dealing with stressful situations like tight deadlines and unexpected errors.\n\nFinally, The Clean Coder encourages developers to cultivate a mindset of lifelong learning and self-improvement. It serves as both a guide and an inspiration for developers to achieve excellence, not only in their technical skills but also in their conduct as professionals."
  },
  {
    "id": "cea639ce-ee90-4ef9-9fef-c9562a247e99",
    "title": "The Lean Startup",
    "author": "Eric Ries",
    "genre": "Software",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_XyoNwHCdwe.png",
    "coverColor": "#1E73BE",
    "description": "The Lean Startup by Eric Ries is a guide to building and managing startups in a way that maximizes innovation while minimizing wasted effort. The book introduces the concept of the “Lean Startup” methodology, which focuses on quickly turning ideas into products, testing them with real customers, and learning from their feedback to refine and improve.",
    "totalCopies": 17,
    "availableCopies": 17,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_uiRdVQTTm.png",
    "summary": "The Lean Startup by Eric Ries is a guide to building and managing startups in a way that maximizes innovation while minimizing wasted effort. The book introduces the concept of the “Lean Startup” methodology, which focuses on quickly turning ideas into products, testing them with real customers, and learning from their feedback to refine and improve. This approach helps entrepreneurs create successful businesses by avoiding long periods of untested development.\n\nA central idea of the book is the Build-Measure-Learn feedback loop. Startups should build a “minimum viable product” (MVP)—a simplified version of their idea that allows them to test assumptions quickly. By measuring how customers respond to the MVP, startups can learn what works and what doesn’t, enabling them to make informed decisions about whether to pivot (change direction) or persevere (continue improving the same idea). This process reduces the risk of investing time and money into a product that might fail in the market.\n\nThe Lean Startup methodology emphasizes the importance of continuous experimentation and validated learning. Entrepreneurs are encouraged to treat their ideas as hypotheses and to test them rigorously with data rather than assumptions. This scientific approach ensures that decisions are based on evidence, leading to better chances of success.\n\nAnother key aspect is the principle of “innovation accounting,” which focuses on measuring progress in terms of validated learning rather than vanity metrics like website traffic or social media likes. Startups should track meaningful metrics that reflect real customer engagement and satisfaction to ensure they are on the right path.\n\nOverall, The Lean Startup provides a roadmap for creating agile, customer-focused businesses. By focusing on rapid experimentation, data-driven decision-making, and constant iteration, entrepreneurs can navigate uncertainty, avoid unnecessary failures, and build products that truly meet the needs of their customers."
  },
  {
    "id": "68f7c183-b995-4ba3-a644-30110ebb932e",
    "title": "Hábitos Atômicos",
    "author": "James Clear",
    "genre": "Auto ajuda",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_HOCexO5Ms.png",
    "coverColor": "#ffffff",
    "description": "Hábitos Atômicos, de James Clear, é um livro sobre como pequenas mudanças nos hábitos diários podem levar a grandes transformações ao longo do tempo. Clear enfatiza que hábitos são o 'juros compostos' do autodesenvolvimento – pequenas ações repetidas consistentemente produzem resultados extraordinários.\n\nEm vez de focar em grandes mudanças, o livro incentiva os leitores a melhorarem 1% a cada dia, pois esses pequenos avanços se acumulam e geram progresso significativo.\n\nO livro apresenta as 'Quatro Leis da Mudança de Comportamento' como uma estrutura para criar bons hábitos e eliminar maus hábitos: torná-lo óbvio, torná-lo atraente, torná-lo fácil e torná-lo satisfatório. Clear explica como esses princípios podem ser aplicados para reconfigurar hábitos ajustando gatilhos, desejos, respostas e recompensas. Por exemplo, colocar uma garrafa de água na mesa torna o hábito de beber água mais óbvio e acessível.\n\nUma das principais ideias do livro é o papel da identidade na formação dos hábitos. Clear argumenta que mudanças duradouras ocorrem quando nos concentramos em quem queremos nos tornar, e não apenas no que queremos alcançar. Em vez de dizer 'quero ler mais', por exemplo, podemos dizer 'sou uma pessoa que ama aprender'.\n\nO ambiente também tem um papel crucial na formação dos hábitos. Clear enfatiza a importância de projetar nosso espaço para facilitar bons hábitos e dificultar os ruins. Pequenas mudanças, como manter lanches saudáveis visíveis ou remover distrações, podem ter um grande impacto no comportamento.\n\nNo final, Hábitos Atômicos nos lembra que o sucesso não depende de grandes saltos, mas de passos pequenos e consistentes todos os dias. Ao focar em sistemas e fazer ajustes intencionais, qualquer pessoa pode criar mudanças positivas duradouras em sua vida.",
    "totalCopies": 1200,
    "availableCopies": 1200,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_WyfBbHfTp.png",
    "summary": "Hábitos Atômicos, de James Clear, é um livro sobre como pequenas mudanças nos hábitos diários podem levar a grandes transformações ao longo do tempo. Clear enfatiza que hábitos são o 'juros compostos' do autodesenvolvimento – pequenas ações repetidas consistentemente produzem resultados extraordinários.\n\nEm vez de focar em grandes mudanças, o livro incentiva os leitores a melhorarem 1% a cada dia, pois esses pequenos avanços se acumulam e geram progresso significativo.\n\nO livro apresenta as 'Quatro Leis da Mudança de Comportamento' como uma estrutura para criar bons hábitos e eliminar maus hábitos: torná-lo óbvio, torná-lo atraente, torná-lo fácil e torná-lo satisfatório. Clear explica como esses princípios podem ser aplicados para reconfigurar hábitos ajustando gatilhos, desejos, respostas e recompensas. Por exemplo, colocar uma garrafa de água na mesa torna o hábito de beber água mais óbvio e acessível.\n\nUma das principais ideias do livro é o papel da identidade na formação dos hábitos. Clear argumenta que mudanças duradouras ocorrem quando nos concentramos em quem queremos nos tornar, e não apenas no que queremos alcançar. Em vez de dizer 'quero ler mais', por exemplo, podemos dizer 'sou uma pessoa que ama aprender'.\n\nO ambiente também tem um papel crucial na formação dos hábitos. Clear enfatiza a importância de projetar nosso espaço para facilitar bons hábitos e dificultar os ruins. Pequenas mudanças, como manter lanches saudáveis visíveis ou remover distrações, podem ter um grande impacto no comportamento.\n\nNo final, Hábitos Atômicos nos lembra que o sucesso não depende de grandes saltos, mas de passos pequenos e consistentes todos os dias. Ao focar em sistemas e fazer ajustes intencionais, qualquer pessoa pode criar mudanças positivas duradouras em sua vida."
  },
  {
    "id": "b6b9cc5d-95fd-488e-b1df-2a805678b430",
    "title": "React em ação",
    "author": "Mark Tielens Thomas",
    "genre": "Desenvolvimento web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_rzjr6TrKF.png",
    "coverColor": "#302428",
    "description": "React em ação, de Mark Tielens Thomas, é um guia prático para dominar o React, uma biblioteca JavaScript popular para construir interfaces de usuário. O livro é ideal para desenvolvedores que desejam aprender React desde o início e para aqueles que buscam aprofundar sua compreensão de seu ecossistema ",
    "totalCopies": 57,
    "availableCopies": 57,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_jO3MUj8-s.png",
    "summary": "React em ação, de Mark Tielens Thomas, é um guia prático para dominar o React, uma biblioteca JavaScript popular para a construção de interfaces de usuário. O livro é ideal para desenvolvedores que desejam aprender React desde o início e para aqueles que buscam aprofundar sua compreensão de seu ecossistema. . Com explicações claras e exemplos práticos, ele capacita os leitores a criar aplicativos Web dinâmicos e interativos.\n\nO livro começa apresentando os fundamentos do React, incluindo componentes, JSX, props e gerenciamento de estado. temas, como métodos de ciclo de vida, ganchos e otimização de desempenho O foco principal está na natureza declarativa do React e em como ele simplifica a construção de interfaces de usuário complexas.\n\nOs leitores são orientados na criação de aplicativos do mundo real, ganhando experiência com ferramentas essenciais como Redux para estado. gerenciamento, React Router para navegação e estruturas de teste como Jest e Enzyme também aborda a integração do React com serviços de back-end, garantindo uma compreensão completa da construção de aplicativos full-stack.\n\nUm dos recursos de destaque do React in Action é. sua ênfase nas práticas modernas de desenvolvimento. Ele apresenta aos leitores as melhores práticas para arquitetura de componentes, design reutilizável e depuração eficaz. Ao final do livro, os desenvolvedores terão confiança para enfrentar projetos React com uma base sólida."
  },
  {
    "id": "8f45a8ad-e0e1-437e-8987-5bcbaca24bd9",
    "title": "JavaScript: As Boas Partes",
    "author": "Douglas Crockford",
    "genre": "Programação",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_-xOn0_b32.png",
    "coverColor": "#00a199",
    "description": "JavaScript: as boas partes, de Douglas Crockford, é um guia conciso para compreender e usar os melhores recursos do JavaScript, evitando suas armadilhas. Este livro foi desenvolvido para desenvolvedores que desejam escrever código JavaScript limpo, eficiente e confiável, concentrando-se apenas no pontos fortes da linguagem.",
    "totalCopies": 501,
    "availableCopies": 500,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KOYG_-R2J.png",
    "summary": "JavaScript: as boas partes, de Douglas Crockford, é um guia conciso para compreender e usar os melhores recursos do JavaScript, evitando suas armadilhas. Este livro foi desenvolvido para desenvolvedores que desejam escrever código JavaScript limpo, eficiente e confiável, concentrando-se apenas no os pontos fortes da linguagem.\n\nCrockford identifica as partes boas do JavaScript, como sua natureza dinâmica orientada a objetos, recursos de programação funcional e simplicidade quando usado corretamente. Ele também destaca recursos problemáticos como variáveis ​​globais, coerção de tipos e. comportamento inconsistente, aconselhando os leitores a evitar isso. O livro enfatiza a importância de compreender as peculiaridades do JavaScript e usar ferramentas e práticas para minimizar erros.\n\nOs principais tópicos abordados incluem sintaxe, objetos, funções, herança, matrizes, expressões regulares e. métodos para gerenciar a qualidade do código também apresenta práticas recomendadas para escrever código sustentável e oferece exemplos práticos para demonstrar como usar JavaScript de maneira eficaz em aplicativos do mundo real."
  },
  {
    "id": "d125678e-80d7-4ba8-97a6-cc6ee4b980ef",
    "title": "Javascript Eloquente",
    "author": "Marijn Haverbeke",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_acYPV3jV0.png",
    "coverColor": "#F8D347",
    "description": "JavaScript Eloquente de Marijn Haverbeke é um mergulho profundo em JavaScript, projetado para desenvolvedores que desejam dominar a linguagem. O livro combina explicações claras, exemplos práticos e exercícios para ajudar os leitores a compreender os recursos básicos e avançados do JavaScript.",
    "totalCopies": 121,
    "availableCopies": 120,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_l0umqa2H6.png",
    "summary": "JavaScript Eloquente de Marijn Haverbeke é um mergulho profundo em JavaScript, projetado para desenvolvedores que desejam dominar a linguagem. O livro combina explicações claras, exemplos práticos e exercícios para ajudar os leitores a compreender os recursos básicos e avançados do JavaScript. É ideal para para aqueles que são novos na linguagem e para desenvolvedores experientes que buscam aprimorar suas habilidades.\n\nO livro começa com uma introdução aos conceitos de programação e faz uma transição rápida para os fundamentos do JavaScript, incluindo variáveis, funções e estruturas de controle. Em seguida, ele se aprofunda em mais detalhes. tópicos avançados como encerramentos, programação assíncrona e design orientado a objetos Haverbeke também explora o ecossistema JavaScript, incluindo APIs baseadas em navegador, Node.js e recursos modernos da linguagem.\n\nUma característica exclusiva do livro é sua ênfase em. escrevendo código elegante, limpo e eficiente Os leitores são incentivados a pensar criticamente sobre a solução de problemas e recebem exercícios que os desafiam a aplicar conceitos em cenários do mundo real. Os projetos do livro, incluindo a construção de um jogo e uma linguagem de programação básica, oferecem experiência prática que solidifica o aprendizado."
  },
  {
    "id": "383a8140-08b8-4c7c-97a7-e1bc68dc1488",
    "title": "Fullstack React: O guia completo de ReactJS e amigos.",
    "author": "Accomazzo, Greif, and Murray",
    "genre": "Desenvolvimento web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_aiko1JtEn.png",
    "coverColor": "#eac8bf",
    "description": "Fullstack React: O guia completo de ReactJS e amigos de Accomazzo, Greif e Murray é um recurso abrangente para desenvolvedores que desejam dominar o React e construir aplicativos full-stack.",
    "totalCopies": 11,
    "availableCopies": 11,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_0HxM1wQe62.png",
    "summary": "Fullstack React: O guia completo de ReactJS e amigos de Accomazzo, Greif e Murray é um recurso abrangente para desenvolvedores que desejam dominar o React e construir aplicativos full-stack. O livro fornece tutoriais passo a passo, projetos práticos e insights profundos sobre o ecossistema do React, tornando-o um excelente guia para desenvolvedores iniciantes e experientes.\n\nO livro começa com os fundamentos do React, incluindo componentes, estados e adereços, antes de mergulhar em conceitos mais avançados, como ciclo de vida. métodos, ganchos e otimização de desempenho. Ele também cobre ferramentas importantes no ecossistema React, como Redux para gerenciamento de estado, React Router para navegação e Webpack para empacotamento.\n\nUm grande destaque do livro é seu foco na construção real. Os leitores trabalham em projetos como um aplicativo Web dinâmico e aprendem a integrar o React com tecnologias de back-end e APIs. Os autores enfatizam as melhores práticas e padrões, ajudando os desenvolvedores a escrever código limpo e sustentável que pode ser dimensionado de maneira eficaz.\n\nO livro também explora. tópicos como testar React aplicativos, usando renderização no lado do servidor com Next.js e implantando aplicativos para produção. Ele capacita os desenvolvedores com as habilidades necessárias para criar aplicações web modernas e de alto desempenho do início ao fim."
  },
  {
    "id": "cc625b42-6852-44af-b3a3-e668fa967b8e",
    "title": "Quebrando a entrevista de codificação",
    "author": "Gayle Laakmann McDowell",
    "genre": "Programação",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_yryJFVYWd.png",
    "coverColor": "#97cc02",
    "description": "Quebrando a entrevista de codificação, de Gayle Laakmann McDowell, é um guia abrangente para engenheiros de software que se preparam para entrevistas técnicas. O livro está repleto de insights, estratégias e mais de 180 questões de programação que simulam cenários reais de entrevistas.",
    "totalCopies": 32,
    "availableCopies": 32,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_vcXsdjkqw.png",
    "summary": "Quebrando a entrevista de codificação, de Gayle Laakmann McDowell, é um guia completo para engenheiros de software que se preparam para entrevistas técnicas. O livro está repleto de insights, estratégias e mais de 180 questões de programação que simulam cenários reais de entrevistas. Ele fornece não apenas soluções, mas também explicações detalhadas para ajudar os leitores a entender o raciocínio e melhorar suas habilidades de resolução de problemas.\n\nO livro começa orientando os leitores através do processo de entrevista técnica, oferecendo dicas sobre otimização de currículos, questões comportamentais e compreensão do que os entrevistadores estão procurando. problemas em partes gerenciáveis ​​e explica algoritmos, estruturas de dados e técnicas de codificação essenciais para resolvê-los.\n\nUma característica de destaque do livro é seu foco em estratégias para lidar com tópicos comuns como matrizes, listas vinculadas, árvores, gráficos, programação dinâmica e design de sistema. McDowell também inclui conselhos sobre como lidar com a pressão, comunicar-se de maneira eficaz durante as entrevistas e depurar soluções em tempo real, tornando-o mais do que apenas uma coleção de problemas - é um kit de ferramentas de carreira."
  }
]
